tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void handleStopPost() {
    if (!Esp32BaseWeb::checkPostAllowed("manual_stop")) {
        return;
    }
    RunController::stop();
    Esp32BaseWeb::redirectSeeOther("/irrigation/run");
}

void handleZoneSavePost() {
    if (!Esp32BaseWeb::checkPostAllowed("zone_save")) {
        return;
    }
    if (RunController::busy()) {
        Esp32BaseWeb::sendText(409, "zones locked while running");
        return;
    }

    char value[32];
    if (!Esp32BaseWeb::getParam("id", value, sizeof(value))) {
        Esp32BaseWeb::sendText(400, "missing zone id");
        return;
    }
    const uint8_t zoneId = static_cast<uint8_t>(strtoul(value, nullptr, 10));
    const ZoneConfig* current = ZoneService::find(zoneId);
    if (current == nullptr) {
        Esp32BaseWeb::sendText(404, ZoneService::lastError());
        return;
    }

    ZoneConfig zone = *current;
    zone.enabled = parseBoolParam("enabled");
    if (Esp32BaseWeb::getParam("name", value, sizeof(value))) {
        snprintf(zone.name, sizeof(zone.name), "%s", value);
        zone.name[sizeof(zone.name) - 1] = '\0';
    }

    uint32_t minutes = 0;
    if (!parseU32Param("defaultMinutes", 0, 120, zone.defaultDurationSec / 60UL, minutes)) {
        Esp32BaseWeb::sendText(400, "invalid default duration");
        return;
    }
    zone.defaultDurationSec = minutes * 60UL;

    uint32_t flow = 0;
    if (!parseU32Param("standardFlow", 0, 100000, zone.standardFlowMlPerMin, flow)) {
        Esp32BaseWeb::sendText(400, "invalid standard flow");
        return;
    }
    zone.standardFlowMlPerMin = flow;

    if (!ZoneService::saveZone(zone)) {
        Esp32BaseWeb::sendText(400, ZoneService::lastError());
        return;
    }

    Esp32BaseWeb::redirectSeeOther("/irrigation/zones");
}

void handlePlanCreatePost() {
    if (!Esp32BaseWeb::checkPostAllowed("plan_create")) {
        return;
    }
    char name[kPlanNameLength] = "New plan";
    Esp32BaseWeb::getParam("name", name, sizeof(name));
    uint8_t planId = 0;
    if (!PlanService::createPlan(name, planId)) {
        Esp32BaseWeb::sendText(400, PlanService::lastError());
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/irrigation/plans");
}

void handlePlanDeletePost() {
    if (!Esp32BaseWeb::checkPostAllowed("plan_delete")) {
        return;
    }
    char value[8];
    if (!Esp32BaseWeb::getParam("id", value, sizeof(value))) {
        Esp32BaseWeb::sendText(400, "missing plan id");
        return;
    }
    const uint8_t planId = static_cast<uint8_t>(strtoul(value, nullptr, 10));
    if (!PlanService::deletePlan(planId)) {
        Esp32BaseWeb::sendText(400, PlanService::lastError());
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/irrigation/plans");
}

void handlePlanSavePost() {
    if (!Esp32BaseWeb::checkPostAllowed("plan_save")) {
        return;
    }

    char value[32];
    if (!Esp32BaseWeb::getParam("id", value, sizeof(value))) {
        Esp32BaseWeb::sendText(400, "missing plan id");
        return;
    }
    const uint8_t planId = static_cast<uint8_t>(strtoul(value, nullptr, 10));
    const WateringPlan* current = PlanService::find(planId);
    if (current == nullptr) {
        Esp32BaseWeb::sendText(404, PlanService::lastError());
        return;
    }

    WateringPlan plan = *current;
    plan.enabled = parseBoolParam("enabled");
    if (Esp32BaseWeb::getParam("name", value, sizeof(value))) {
        snprintf(plan.name, sizeof(plan.name), "%s", value);
        plan.name[sizeof(plan.name) - 1] = '\0';
    }

    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "se%u", i);
        const bool enabled = parseBoolParam(key);
        snprintf(key, sizeof(key), "st%u", i);
        uint16_t minuteOfDay = kInvalidMinuteOfDay;
        if (!parseMinuteParam(key, enabled, minuteOfDay)) {
            Esp32BaseWeb::sendText(400, "invalid start time");
            return;
        }
        plan.startTimes[i].enabled = enabled;
        plan.startTimes[i].minuteOfDay = minuteOfDay;
    }

    for (uint8_t i = 0; i < kMaxZones; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "z%u", i + 1);
        uint32_t minutes = 0;
        if (!parseU32Param(key, 0, 120, plan.zoneDurationSec[i] / 60UL, minutes)) {
            Esp32BaseWeb::sendText(400, "invalid zone duration");
            return;
        }
        plan.zoneDurationSec[i] = minutes * 60UL;
    }

    if (!PlanService::savePlan(plan)) {
        Esp32BaseWeb::sendText(400, PlanService::lastError());
        return;
    }

    Esp32BaseWeb::redirectSeeOther("/irrigation/plans");
}

void handleSettingsSavePost() {
    if (!Esp32BaseWeb::checkPostAllowed("settings_save")) {
        return;
    }
    if (RunController::busy()) {
        Esp32BaseWeb::sendText(409, "settings locked while running");
        return;
    }

    IrrigationConfig next = ConfigStore::config();
    next.supply.pumpEnabled = parseBoolParam("pumpEnabled");
    next.supply.lowLevelEnabled = parseBoolParam("lowLevelEnabled");
    next.supply.lowLevelContactType = parseBoolParam("lowLevelNormallyClosed") ? ContactType::NormallyClosed : ContactType::NormallyOpen;

    uint32_t value = 0;
    if (!parseU32Param("pumpStartDelayMs", 0, 10000, next.supply.pumpStartDelayMs, value)) {
        Esp32BaseWeb::sendText(400, "invalid pump start delay");
        return;
    }
    next.supply.pumpStartDelayMs = value;

    if (!parseU32Param("pumpStopDelayMs", 0, 10000, next.supply.pumpStopDelayMs, value)) {
        Esp32BaseWeb::sendText(400, "invalid pump stop delay");
        return;
    }
    next.supply.pumpStopDelayMs = value;

    if (!parseU32Param("lowLevelDebounceMs", 0, 10000, next.supply.lowLevelDebounceMs, value)) {
        Esp32BaseWeb::sendText(400, "invalid low-level debounce");
        return;
    }
    next.supply.lowLevelDebounceMs = value;

    if (!parseU32Param("pulsesPerLiter", 0, 100000, next.flow.pulsesPerLiter, value)) {
        Esp32BaseWeb::sendText(400, "invalid pulses per liter");
        return;
    }
    next.flow.pulsesPerLiter = value;

    if (!parseU32Param("startupGraceSec", 0, 120, next.flow.startupGraceSec, value)) {
        Esp32BaseWeb::sendText(400, "invalid startup grace");
        return;
    }
    next.flow.startupGraceSec = value;

