tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    if (!parseU32Param("noFlowConfirmSec", 1, 600, next.flow.noFlowConfirmSec, value)) {
        Esp32BaseWeb::sendText(400, "invalid no-flow confirm");
        return;
    }
    next.flow.noFlowConfirmSec = value;

    if (!parseU32Param("leakWindowSec", 1, 600, next.flow.leakWindowSec, value)) {
        Esp32BaseWeb::sendText(400, "invalid leak window");
        return;
    }
    next.flow.leakWindowSec = value;

    if (!parseU32Param("leakPulseThreshold", 1, 1000, next.flow.leakPulseThreshold, value)) {
        Esp32BaseWeb::sendText(400, "invalid leak pulse threshold");
        return;
    }
    next.flow.leakPulseThreshold = value;

    if (!parseU32Param("lowFlowPercent", 1, 100, next.flow.lowFlowPercent, value)) {
        Esp32BaseWeb::sendText(400, "invalid low-flow percent");
        return;
    }
    next.flow.lowFlowPercent = static_cast<uint8_t>(value);

    if (!parseU32Param("highFlowPercent", 100, 1000, next.flow.highFlowPercent, value)) {
        Esp32BaseWeb::sendText(400, "invalid high-flow percent");
        return;
    }
    next.flow.highFlowPercent = static_cast<uint16_t>(value);

    if (!parseU32Param("pullInMs", 50, 3000, next.valve.pullInMs, value)) {
        Esp32BaseWeb::sendText(400, "invalid valve pull-in");
        return;
    }
    next.valve.pullInMs = value;

    if (!parseU32Param("holdPercent", 1, 100, next.valve.holdPercent, value)) {
        Esp32BaseWeb::sendText(400, "invalid valve hold percent");
        return;
    }
    next.valve.holdPercent = static_cast<uint8_t>(value);

    if (!parseU32Param("maxZoneDurationMin", 1, 360, next.valve.maxZoneDurationSec / 60UL, value)) {
        Esp32BaseWeb::sendText(400, "invalid max Zone duration");
        return;
    }
    next.valve.maxZoneDurationSec = value * 60UL;

    if (!ConfigStore::save(next)) {
        Esp32BaseWeb::sendText(400, ConfigStore::lastError());
        return;
    }
    BoardHardware::configure(ConfigStore::config().valve, ConfigStore::config().supply);
    Esp32BaseWeb::redirectSeeOther("/irrigation/settings");
}

void sendRunPanel() {
    Esp32BaseWeb::beginPanel("Manual watering");
    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/run/start'><table><thead><tr><th>Zone</th><th>Status</th><th>Minutes</th></tr></thead><tbody>");
    const IrrigationConfig& config = ConfigStore::config();
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        char row[192];
        snprintf(row, sizeof(row),
                 "<tr><td>Zone %u</td><td>Enabled</td><td><input name='z%u' type='number' min='0' max='120' value='%lu'></td></tr>",
                 zone.id,
                 zone.id,
                 static_cast<unsigned long>(zone.defaultDurationSec / 60UL));
        Esp32BaseWeb::sendChunk(row);
    }
    Esp32BaseWeb::sendChunk("</tbody></table><div class='actions'><input type='submit' value='Start manual run'></div></form>");
    Esp32BaseWeb::endPanel();
}

void sendPlanNowPanel() {
    const IrrigationConfig& config = ConfigStore::config();
    bool hasPlan = false;
    Esp32BaseWeb::beginPanel("Run plan now");
    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/run/plan-now'><select name='plan'>");
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used || !plan.enabled) {
            continue;
        }
        hasPlan = true;
        char buf[80];
        snprintf(buf, sizeof(buf), "<option value='%u'>", plan.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(plan.name);
        Esp32BaseWeb::sendChunk("</option>");
    }
    Esp32BaseWeb::sendChunk("</select><div class='actions'><input type='submit' value='Run selected plan now'");
    if (!hasPlan) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></form>");
    if (!hasPlan) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "No enabled plans", "Enable a plan before using this shortcut.");
    }
    Esp32BaseWeb::endPanel();
}

void handleDashboardPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    char value[32];

    Esp32BaseWeb::sendHeader("Irrigation");
    Esp32BaseWeb::sendPageTitle("Irrigation", "Local 12V Zone controller");
    Esp32BaseWeb::beginMetricGrid();
    Esp32BaseWeb::sendMetric("State", runStateName(status.runState), status.busy ? "Running" : "Idle");
    snprintf(value, sizeof(value), "%u / %u", status.enabledZoneCount, kMaxZones);
    Esp32BaseWeb::sendMetric("Enabled Zones", value, "Hardware max 6");
    snprintf(value, sizeof(value), "%u / %u", status.enabledPlanCount, kMaxPlans);
    Esp32BaseWeb::sendMetric("Enabled Plans", value, "Daily plans");
    Esp32BaseWeb::endMetricGrid();
    Esp32BaseWeb::beginPanel("Actions");
    Esp32BaseWeb::sendInfoRowCompactLink("Manual run", "Set enabled Zone durations and start a sequential run.", nullptr, "/irrigation/run", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendInfoRowCompactLink("Plans", "Daily schedules with enable and disable control.", nullptr, "/irrigation/plans", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendInfoRowCompactLink("Zones", "Enable, name and tune each fixed hardware Zone.", nullptr, "/irrigation/zones", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendInfoRowCompactLink("Settings", "Supply, flow and valve driver settings.", nullptr, "/irrigation/settings", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendInfoRowCompactLink("History", "Recent run records and stop reasons.", nullptr, "/irrigation/history", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::sendInfoRowCompactLink("Status API", "Machine-readable current state.", nullptr, "/api/status", "Open", Esp32BaseWeb::UI_INFO);
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleRunPage() {
    const StatusSnapshot status = RunController::statusSnapshot();
    Esp32BaseWeb::sendHeader("Run");
    Esp32BaseWeb::sendPageTitle("Run", "Manual sequential watering");
    if (status.busy) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "Run active", runStateName(status.runState));
        Esp32BaseWeb::beginPanel("Stop");
        Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/run/stop'><div class='actions'><input class='danger' type='submit' value='Stop run'></div></form>");
        Esp32BaseWeb::endPanel();
    } else {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "Idle", "No active watering run.");
    }
    sendRunPanel();
    sendPlanNowPanel();
    Esp32BaseWeb::sendFooter();
}

