tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
void handleZonesPage() {
    Esp32BaseWeb::sendHeader("Zones");
    Esp32BaseWeb::sendPageTitle("Zones", "Enable only the wired irrigation Zones");
    Esp32BaseWeb::beginPanel("Zone configuration");
    Esp32BaseWeb::sendChunk("<table><thead><tr><th>Zone</th><th>Name</th><th>Enabled</th><th>Default minutes</th><th>Standard flow ml/min</th><th>Save</th></tr></thead><tbody>");

    const IrrigationConfig& config = ConfigStore::config();
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        char buf[256];
        snprintf(buf, sizeof(buf), "<tr><form method='post' action='/irrigation/zones/save'><td>Zone %u<input type='hidden' name='id' value='%u'></td><td><input name='name' maxlength='23' value='",
                 zone.id, zone.id);
        Esp32BaseWeb::sendChunk(buf);
        sendEscapedValue(zone.name);
        snprintf(buf, sizeof(buf), "'></td><td><input type='checkbox' name='enabled' value='1'%s></td><td><input type='number' min='0' max='120' name='defaultMinutes' value='%lu'></td><td><input type='number' min='0' max='100000' name='standardFlow' value='%lu'></td><td><input type='submit' value='Save'></td></form></tr>",
                 zone.enabled ? " checked" : "",
                 static_cast<unsigned long>(zone.defaultDurationSec / 60UL),
                 static_cast<unsigned long>(zone.standardFlowMlPerMin));
        Esp32BaseWeb::sendChunk(buf);
    }

    Esp32BaseWeb::sendChunk("</tbody></table>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void sendPlanStartFields(const WateringPlan& plan) {
    Esp32BaseWeb::sendChunk("<fieldset><legend>Start times</legend>");
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        char timeText[8];
        minuteToText(plan.startTimes[i].minuteOfDay, timeText, sizeof(timeText));
        char buf[192];
        snprintf(buf, sizeof(buf), "<label><input type='checkbox' name='se%u' value='1'%s> Slot %u</label> <input type='time' name='st%u' value='",
                 i,
                 plan.startTimes[i].enabled ? " checked" : "",
                 i + 1,
                 i);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::sendChunk(timeText);
        Esp32BaseWeb::sendChunk("'><br>");
    }
    Esp32BaseWeb::sendChunk("</fieldset>");
}

void sendPlanZoneDurationFields(const WateringPlan& plan) {
    Esp32BaseWeb::sendChunk("<fieldset><legend>Enabled Zone durations</legend><table><thead><tr><th>Zone</th><th>Minutes</th></tr></thead><tbody>");
    const IrrigationConfig& config = ConfigStore::config();
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled) {
            continue;
        }
        char buf[160];
        snprintf(buf, sizeof(buf), "<tr><td>Zone %u ", zone.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        snprintf(buf, sizeof(buf), "</td><td><input type='number' min='0' max='120' name='z%u' value='%lu'></td></tr>",
                 zone.id,
                 static_cast<unsigned long>(plan.zoneDurationSec[i] / 60UL));
        Esp32BaseWeb::sendChunk(buf);
    }
    Esp32BaseWeb::sendChunk("</tbody></table></fieldset>");
}

void handlePlansPage() {
    Esp32BaseWeb::sendHeader("Plans");
    Esp32BaseWeb::sendPageTitle("Plans", "Daily schedules, up to 8 plans and 4 start times each");

    Esp32BaseWeb::beginPanel("Create plan");
    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/plans/create'><input name='name' maxlength='31' value='New plan'><div class='actions'><input type='submit' value='Create disabled plan'></div></form>");
    Esp32BaseWeb::endPanel();

    const IrrigationConfig& config = ConfigStore::config();
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used) {
            continue;
        }
        Esp32BaseWeb::beginPanel(plan.name);
        char buf[160];
        snprintf(buf, sizeof(buf), "<form method='post' action='/irrigation/plans/save'><input type='hidden' name='id' value='%u'><label>Name</label><input name='name' maxlength='31' value='",
                 plan.id);
        Esp32BaseWeb::sendChunk(buf);
        sendEscapedValue(plan.name);
        Esp32BaseWeb::sendChunk("'><label><input type='checkbox' name='enabled' value='1'");
        sendChecked(plan.enabled);
        Esp32BaseWeb::sendChunk("> Enabled for daily schedule and run-now</label>");
        sendPlanStartFields(plan);
        sendPlanZoneDurationFields(plan);
        Esp32BaseWeb::sendChunk("<div class='actions'><input type='submit' value='Save plan'></div></form>");
        snprintf(buf, sizeof(buf), "<form method='post' action='/irrigation/plans/delete' onsubmit=\"return confirm('Delete plan?')\"><input type='hidden' name='id' value='%u'><div class='actions'><input class='danger' type='submit' value='Delete plan'></div></form>",
                 plan.id);
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::endPanel();
    }

    Esp32BaseWeb::sendFooter();
}

void sendNumberInput(const char* name, uint32_t value, uint32_t minValue, uint32_t maxValue) {
    char buf[128];
    snprintf(buf, sizeof(buf), "<input type='number' name='%s' min='%lu' max='%lu' value='%lu'>",
             name,
             static_cast<unsigned long>(minValue),
             static_cast<unsigned long>(maxValue),
             static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(buf);
}

void handleSettingsPage() {
    const IrrigationConfig& config = ConfigStore::config();
    Esp32BaseWeb::sendHeader("Settings");
    Esp32BaseWeb::sendPageTitle("Settings", "Supply, flow safety and valve driver");
    if (RunController::busy()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "Settings locked", "Stop the current run before saving global settings.");
    }

    Esp32BaseWeb::beginPanel("Global settings");
    Esp32BaseWeb::sendChunk("<form method='post' action='/irrigation/settings/save'><table><tbody>");

