tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
    Esp32BaseWeb::sendChunk("<tr><td>Self-priming pump signal</td><td><input type='checkbox' name='pumpEnabled' value='1'");
    sendChecked(config.supply.pumpEnabled);
    Esp32BaseWeb::sendChunk("></td></tr>");
    Esp32BaseWeb::sendChunk("<tr><td>Pump start delay ms</td><td>");
    sendNumberInput("pumpStartDelayMs", config.supply.pumpStartDelayMs, 0, 10000);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Pump stop delay ms</td><td>");
    sendNumberInput("pumpStopDelayMs", config.supply.pumpStopDelayMs, 0, 10000);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Low-level sensor</td><td><input type='checkbox' name='lowLevelEnabled' value='1'");
    sendChecked(config.supply.lowLevelEnabled);
    Esp32BaseWeb::sendChunk("></td></tr><tr><td>Low-level normally closed</td><td><input type='checkbox' name='lowLevelNormallyClosed' value='1'");
    sendChecked(config.supply.lowLevelContactType == ContactType::NormallyClosed);
    Esp32BaseWeb::sendChunk("></td></tr><tr><td>Low-level debounce ms</td><td>");
    sendNumberInput("lowLevelDebounceMs", config.supply.lowLevelDebounceMs, 0, 10000);

    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Flow pulses per liter</td><td>");
    sendNumberInput("pulsesPerLiter", config.flow.pulsesPerLiter, 0, 100000);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Startup flow grace sec</td><td>");
    sendNumberInput("startupGraceSec", config.flow.startupGraceSec, 0, 120);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>No-flow confirm sec</td><td>");
    sendNumberInput("noFlowConfirmSec", config.flow.noFlowConfirmSec, 1, 600);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Standby leak window sec</td><td>");
    sendNumberInput("leakWindowSec", config.flow.leakWindowSec, 1, 600);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Standby leak pulses</td><td>");
    sendNumberInput("leakPulseThreshold", config.flow.leakPulseThreshold, 1, 1000);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Low-flow percent</td><td>");
    sendNumberInput("lowFlowPercent", config.flow.lowFlowPercent, 1, 100);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>High-flow percent</td><td>");
    sendNumberInput("highFlowPercent", config.flow.highFlowPercent, 100, 1000);

    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Valve pull-in ms</td><td>");
    sendNumberInput("pullInMs", config.valve.pullInMs, 50, 3000);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Valve hold percent</td><td>");
    sendNumberInput("holdPercent", config.valve.holdPercent, 1, 100);
    Esp32BaseWeb::sendChunk("</td></tr><tr><td>Max Zone duration min</td><td>");
    sendNumberInput("maxZoneDurationMin", config.valve.maxZoneDurationSec / 60UL, 1, 360);
    Esp32BaseWeb::sendChunk("</td></tr>");

    Esp32BaseWeb::sendChunk("</tbody></table><div class='actions'><input type='submit' value='Save settings'");
    if (RunController::busy()) {
        Esp32BaseWeb::sendChunk(" disabled");
    }
    Esp32BaseWeb::sendChunk("></div></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleHistoryPage() {
    Esp32BaseWeb::sendHeader("History");
    Esp32BaseWeb::sendPageTitle("History", "Recent run records");
    Esp32BaseWeb::beginPanel("Recent runs");
    if (!HistoryService::readRecent(g_historyViewBuffer, sizeof(g_historyViewBuffer))) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "History unavailable", HistoryService::lastError());
    } else if (g_historyViewBuffer[0] == '\0') {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_INFO, "No run history", "Run records will appear after watering completes, stops or faults.");
    } else {
        Esp32BaseWeb::sendChunk("<pre>");
        Esp32BaseWeb::writeHtmlEscaped(g_historyViewBuffer);
        Esp32BaseWeb::sendChunk("</pre>");
    }
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

} // namespace

void IrrigationWeb::registerRoutes() {
    Esp32BaseWeb::addPage("/irrigation", "Irrigation", handleDashboardPage);
    Esp32BaseWeb::addPage("/irrigation/run", "Run", handleRunPage);
    Esp32BaseWeb::addPage("/irrigation/zones", "Zones", handleZonesPage);
    Esp32BaseWeb::addPage("/irrigation/plans", "Plans", handlePlansPage);
    Esp32BaseWeb::addPage("/irrigation/settings", "Settings", handleSettingsPage);
    Esp32BaseWeb::addPage("/irrigation/history", "History", handleHistoryPage);
    Esp32BaseWeb::addRoute("/irrigation/run/start", Esp32BaseWeb::METHOD_POST, handleManualStartPost);
    Esp32BaseWeb::addRoute("/irrigation/run/plan-now", Esp32BaseWeb::METHOD_POST, handlePlanNowPost);
    Esp32BaseWeb::addRoute("/irrigation/run/stop", Esp32BaseWeb::METHOD_POST, handleStopPost);
    Esp32BaseWeb::addRoute("/irrigation/zones/save", Esp32BaseWeb::METHOD_POST, handleZoneSavePost);
    Esp32BaseWeb::addRoute("/irrigation/plans/create", Esp32BaseWeb::METHOD_POST, handlePlanCreatePost);
    Esp32BaseWeb::addRoute("/irrigation/plans/save", Esp32BaseWeb::METHOD_POST, handlePlanSavePost);
    Esp32BaseWeb::addRoute("/irrigation/plans/delete", Esp32BaseWeb::METHOD_POST, handlePlanDeletePost);
    Esp32BaseWeb::addRoute("/irrigation/settings/save", Esp32BaseWeb::METHOD_POST, handleSettingsSavePost);
    Esp32BaseWeb::addApi("/api/status", handleStatusApi);
    Esp32BaseWeb::addApi("/api/run/current", handleStatusApi);
    Esp32BaseWeb::addApi("/api/zones", handleZonesApi);
    Esp32BaseWeb::addApi("/api/plans", handlePlansApi);
    Esp32BaseWeb::addApi("/api/history", handleHistoryApi);
    Esp32BaseWeb::addNavItem("/irrigation", "Irrigation");
}

} // namespace Irrigation
